// 1. Напишите программу, которая на вход принимает два
// числа и проверяет, является ли первое число квадратом
// второго.
// a = 25, b = 5 -> да
// a = 2, b = 10 -> нет
// a = 9, b = -3 -> да
// a = -3 b = 9 -> нет

// 3. Напишите программу, которая будет выдавать
// название дня недели по заданному номеру.
// 3 -> Среда
// 5 -> Пятница
// 10 мин

// int a = 2;
// int b = 10;
// int square = (b*b);
// if (square == a)
// {
//     Console.WriteLine($"b является квадратом a");
// }
// else
// {
//     Console.WriteLine($"b не является квадратом a");
// }