// Напишите программу, которая на вход
// принимает число и выдаёт его квадрат (число
// умноженное на само себя).
// Например:
// 4 -> 16
// -3 -> 9
// -7 -> 49
//Console.Write("Введите целое число: ");
//int num = Convert.ToInt32(Console.ReadLine());
//double square = Math.Pow(num, 2);

double d = 5.55;
int i = 2022;
byte b = 155;
b = (byte)i;
Console.Write(b);
//Console.Write($"Квадрат числа {num} будет равен {square} ");
